app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Wed, 10 Jul 2013 07:49:20 UTC +00:00], ["email", "habin@yahoo.com"], ["name", "habin"], ["updated_at", Wed, 10 Jul 2013 07:49:20 UTC +00:00]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save